**Â§ç‰π†Ôºö**Êï∞ÊçÆÂàÜÊûêÁöÑÁ¨¨‰∏ÄÊ≠•ÔºåÂä†ËΩΩÊï∞ÊçÆÊàë‰ª¨Â∑≤ÁªèÂ≠¶‰π†ÂÆåÊØï‰∫Ü„ÄÇÂΩìÊï∞ÊçÆÂ±ïÁé∞Âú®Êàë‰ª¨Èù¢ÂâçÁöÑÊó∂ÂÄôÔºåÊàë‰ª¨ÊâÄË¶ÅÂÅöÁöÑÁ¨¨‰∏ÄÊ≠•Â∞±ÊòØËÆ§ËØÜ‰ªñÔºå‰ªäÂ§©Êàë‰ª¨Ë¶ÅÂ≠¶‰π†ÁöÑÂ∞±ÊòØ**‰∫ÜËß£Â≠óÊÆµÂê´‰πâ‰ª•ÂèäÂàùÊ≠•ËßÇÂØüÊï∞ÊçÆ**„ÄÇ

## 1 Á¨¨‰∏ÄÁ´†ÔºöÊï∞ÊçÆËΩΩÂÖ•ÂèäÂàùÊ≠•ËßÇÂØü

### 1.4 Áü•ÈÅì‰Ω†ÁöÑÊï∞ÊçÆÂè´‰ªÄ‰πà
Êàë‰ª¨Â≠¶‰π†pandasÁöÑÂü∫Á°ÄÊìç‰ΩúÔºåÈÇ£‰πà‰∏ä‰∏ÄËäÇÈÄöËøápandasÂä†ËΩΩ‰πãÂêéÁöÑÊï∞ÊçÆÔºåÂÖ∂Êï∞ÊçÆÁ±ªÂûãÊòØ‰ªÄ‰πàÂë¢Ôºü

**ÂºÄÂßãÂâçÂØºÂÖ•numpyÂíåpandas**

In [6]:
import numpy as np
import pandas as pd

#### 1.4.1 ‰ªªÂä°‰∏ÄÔºöpandas‰∏≠Êúâ‰∏§‰∏™Êï∞ÊçÆÁ±ªÂûãDateFrameÂíåSeriesÔºåÈÄöËøáÊü•ÊâæÁÆÄÂçï‰∫ÜËß£‰ªñ‰ª¨„ÄÇÁÑ∂ÂêéËá™Â∑±ÂÜô‰∏Ä‰∏™ÂÖ≥‰∫éËøô‰∏§‰∏™Êï∞ÊçÆÁ±ªÂûãÁöÑÂ∞è‰æãÂ≠êüå∞[ÂºÄÊîæÈ¢ò]

In [7]:
#ÂÜôÂÖ•‰ª£Á†Å
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a   -0.630930
b   -1.813923
c   -0.057038
d   -0.103170
e    1.322260
dtype: float64

In [8]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
d

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64,
 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [10]:
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [ ]:
'''
#Êàë‰ª¨‰∏æÁöÑ‰æãÂ≠ê
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
example_1 = pd.Series(sdata)
example_1
'''

In [ ]:
'''
#Êàë‰ª¨‰∏æÁöÑ‰æãÂ≠ê
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
example_2 = pd.DataFrame(data)
example_2
'''

#### 1.4.2 ‰ªªÂä°‰∫åÔºöÊ†πÊçÆ‰∏äËäÇËØæÁöÑÊñπÊ≥ïËΩΩÂÖ•"train.csv"Êñá‰ª∂

In [11]:
#ÂÜôÂÖ•‰ª£Á†Å
df = pd.read_csv('train.csv')

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

‰πüÂèØ‰ª•Âä†ËΩΩ‰∏ä‰∏ÄËäÇËØæ‰øùÂ≠òÁöÑ"train_chinese.csv"Êñá‰ª∂„ÄÇÈÄöËøáÁøªËØëÁâàtrain_chinese.csvÁÜüÊÇâ‰∫ÜËøô‰∏™Êï∞ÊçÆÈõÜÔºåÁÑ∂ÂêéÊàë‰ª¨ÂØπtrian.csvÊù•ËøõË°åÊìç‰Ωú
#### 1.4.3 ‰ªªÂä°‰∏âÔºöÊü•ÁúãDataFrameÊï∞ÊçÆÁöÑÊØèÂàóÁöÑÂêçÁß∞

In [13]:
#ÂÜôÂÖ•‰ª£Á†Å
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.4‰ªªÂä°ÂõõÔºöÊü•Áúã"Cabin"ËøôÂàóÁöÑÊâÄÊúâÂÄº[ÊúâÂ§öÁßçÊñπÊ≥ï]

In [14]:
#ÂÜôÂÖ•‰ª£Á†Å
df.Cabin

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [15]:
#ÂÜôÂÖ•‰ª£Á†Å
df['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

#### 1.4.5 ‰ªªÂä°‰∫îÔºöÂä†ËΩΩÊñá‰ª∂"test_1.csv"ÔºåÁÑ∂ÂêéÂØπÊØî"train.csv"ÔºåÁúãÁúãÊúâÂì™‰∫õÂ§öÂá∫ÁöÑÂàóÔºåÁÑ∂ÂêéÂ∞ÜÂ§öÂá∫ÁöÑÂàóÂà†Èô§
ÁªèËøáÊàë‰ª¨ÁöÑËßÇÂØüÂèëÁé∞‰∏Ä‰∏™ÊµãËØïÈõÜtest_1.csvÊúâ‰∏ÄÂàóÊòØÂ§ö‰ΩôÁöÑÔºåÊàë‰ª¨ÈúÄË¶ÅÂ∞ÜËøô‰∏™Â§ö‰ΩôÁöÑÂàóÂà†Âéª

In [20]:
#ÂÜôÂÖ•‰ª£Á†Å
test_1 = pd.read_csv('test_1.csv')
test_1.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,100
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,100

In [21]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
#ÂÜôÂÖ•‰ª£Á†Å
del test_1['a']
test_1.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
test_1 = pd.read_csv('test_1.csv')
test_1.pop('a')
test_1.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [27]:
test_1 = pd.read_csv('test_1.csv')
test_1.drop(['a'] , axis = 1)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

„ÄêÊÄùËÄÉ„ÄëËøòÊúâÂÖ∂‰ªñÁöÑÂà†Èô§Â§ö‰ΩôÁöÑÂàóÁöÑÊñπÂºèÂêóÔºü

In [1]:
# ÊÄùËÄÉÂõûÁ≠î

#### 1.4.6 ‰ªªÂä°ÂÖ≠Ôºö Â∞Ü['PassengerId','Name','Age','Ticket']ËøôÂá†‰∏™ÂàóÂÖÉÁ¥†ÈöêËóèÔºåÂè™ËßÇÂØüÂÖ∂‰ªñÂá†‰∏™ÂàóÂÖÉÁ¥†

In [28]:
#ÂÜôÂÖ•‰ª£Á†Å
test_1 = pd.read_csv('test_1.csv')
test_1.drop(['PassengerId','Name','Age','Ticket'] , axis = 1)

,Unnamed: 0,Survived,Pclass,Sex,SibSp,Parch,Fare,Cabin,Embarked,a
0,0,0,3,male,1,0,7.2500,NaN,S,100
1,1,1,1,female,1,0,71.2833,C85,C,100
2,2,1,3,female,0,0,7.9250,NaN,S,100
3,3,1,1,female,1,0,53.1000,C123,S,100
4,4,0,3,male,0,0,8.0500,NaN,S,100
...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,0,0,13.0000,NaN,S,100
887,887,1,1,female,0,0,30.0000,B42,S,100
888,888,0,3,female,1,2,23.4500,NaN,S,100
889,889,1,1,male,0,0,30.0000,C148,C,100
890,890,0,3,male,0,0,7.7500,NaN,Q,100

„ÄêÊÄùËÄÉ„ÄëÂØπÊØî‰ªªÂä°‰∫îÂíå‰ªªÂä°ÂÖ≠ÔºåÊòØ‰∏çÊòØ‰ΩøÁî®‰∫Ü‰∏ç‰∏ÄÊ†∑ÁöÑÊñπÊ≥ï(ÂáΩÊï∞)ÔºåÂ¶ÇÊûú‰ΩøÁî®‰∏ÄÊ†∑ÁöÑÂáΩÊï∞Â¶Ç‰ΩïÂÆåÊàê‰∏äÈù¢ÁöÑ‰∏çÂêåÁöÑË¶ÅÊ±ÇÂë¢Ôºü

„ÄêÊÄùËÄÉÂõûÁ≠î„Äë

Â¶ÇÊûúÊÉ≥Ë¶ÅÂÆåÂÖ®ÁöÑÂà†Èô§‰Ω†ÁöÑÊï∞ÊçÆÁªìÊûÑÔºå‰ΩøÁî®inplace=TrueÔºåÂõ†‰∏∫‰ΩøÁî®inplaceÂ∞±Â∞ÜÂéüÊï∞ÊçÆË¶ÜÁõñ‰∫ÜÔºåÊâÄ‰ª•ËøôÈáåÊ≤°ÊúâÁî®

### 1.5 Á≠õÈÄâÁöÑÈÄªËæë

Ë°®Ê†ºÊï∞ÊçÆ‰∏≠ÔºåÊúÄÈáçË¶ÅÁöÑ‰∏Ä‰∏™ÂäüËÉΩÂ∞±ÊòØË¶ÅÂÖ∑ÊúâÂèØÁ≠õÈÄâÁöÑËÉΩÂäõÔºåÈÄâÂá∫ÊàëÊâÄÈúÄË¶ÅÁöÑ‰ø°ÊÅØÔºå‰∏¢ÂºÉÊó†Áî®ÁöÑ‰ø°ÊÅØ„ÄÇ

‰∏ãÈù¢Êàë‰ª¨ËøòÊòØÁî®ÂÆûÊàòÊù•Â≠¶‰π†pandasËøô‰∏™ÂäüËÉΩ„ÄÇ

#### 1.5.1 ‰ªªÂä°‰∏ÄÔºö Êàë‰ª¨‰ª•"Age"‰∏∫Á≠õÈÄâÊù°‰ª∂ÔºåÊòæÁ§∫Âπ¥ÈæÑÂú®10Â≤Å‰ª•‰∏ãÁöÑ‰πòÂÆ¢‰ø°ÊÅØ„ÄÇ

In [29]:
#ÂÜôÂÖ•‰ª£Á†Å
test_1['Age']<10

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [35]:
test_1 = pd.read_csv('test_1.csv')
test_1[test_1['Age'] < 10 ]

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
7,7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S,100
10,10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S,100
16,16,17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q,100
24,24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.00,3,1,349909,21.0750,NaN,S,100
43,43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C,100
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
827,827,828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C,100
831,831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S,100
850,850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,347082,31.2750,NaN,S,100
852,852,853,0,3,"Boulos, Miss. Nourelain",female,9.00,1,1,2678,15.2458,NaN,C,100
869,869,870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S,100

#### 1.5.2 ‰ªªÂä°‰∫åÔºö ‰ª•"Age"‰∏∫Êù°‰ª∂ÔºåÂ∞ÜÂπ¥ÈæÑÂú®10Â≤Å‰ª•‰∏äÂíå50Â≤Å‰ª•‰∏ãÁöÑ‰πòÂÆ¢‰ø°ÊÅØÊòæÁ§∫Âá∫Êù•ÔºåÂπ∂Â∞ÜËøô‰∏™Êï∞ÊçÆÂëΩÂêç‰∏∫midage

In [40]:
#ÂÜôÂÖ•‰ª£Á†Å
midage = test_1[(test_1['Age'] > 10 ) &(test_1['Age'] < 50 ) ]
midage

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,100
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,100
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,100
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,100
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,100
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,100
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,100

In [41]:
midage1 = test_1[(test_1['Age'] > 10 ) |(test_1['Age'] < 50 ) ]
midage1

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,100
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,100
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,100
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,100
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,100
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,100
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,100

„ÄêÊèêÁ§∫„Äë‰∫ÜËß£pandasÁöÑÊù°‰ª∂Á≠õÈÄâÊñπÂºè‰ª•ÂèäÂ¶Ç‰Ωï‰ΩøÁî®‰∫§ÈõÜÂíåÂπ∂ÈõÜÊìç‰Ωú

#### 1.5.3 ‰ªªÂä°‰∏âÔºöÂ∞ÜmidageÁöÑÊï∞ÊçÆ‰∏≠Á¨¨100Ë°åÁöÑ"Pclass"Âíå"Sex"ÁöÑÊï∞ÊçÆÊòæÁ§∫Âá∫Êù•

In [42]:
#ÂÜôÂÖ•‰ª£Á†Å
midage.loc[[100], ['Pclass','Sex','Name']]

     Pclass     Sex                     Name
100       3  female  Petranec, Miss. Matilda

In [43]:
midage.to_csv('midage.csv')

In [46]:
midage2 = midage.reset_index(drop = True)
midage2.to_csv('midage2.csv')
midage2.loc[[100], ['Pclass','Sex','Name']]

     Pclass   Sex                               Name
100       2  male  Byles, Rev. Thomas Roussel Davids

„ÄêÊèêÁ§∫„ÄëÂú®ÊäΩÂèñÊï∞ÊçÆ‰∏≠ÔºåÊàë‰ª¨Â∏åÊúõÊï∞ÊçÆÁöÑÁõ∏ÂØπÈ°∫Â∫è‰øùÊåÅ‰∏çÂèòÔºåÁî®‰ªÄ‰πàÂáΩÊï∞ÂèØ‰ª•ËææÂà∞Ëøô‰∏™ÊïàÊûúÂë¢Ôºü

#### 1.5.4 ‰ªªÂä°ÂõõÔºö‰ΩøÁî®locÊñπÊ≥ïÂ∞ÜmidageÁöÑÊï∞ÊçÆ‰∏≠Á¨¨100Ôºå105Ôºå108Ë°åÁöÑ"Pclass"Ôºå"Name"Âíå"Sex"ÁöÑÊï∞ÊçÆÊòæÁ§∫Âá∫Êù•

In [52]:
#ÂÜôÂÖ•‰ª£Á†Å
midage2.loc[[100,105,108], ['Pclass','Name','Sex']]

     Pclass                               Name   Sex
100       2  Byles, Rev. Thomas Roussel Davids  male
105       3           Cribb, Mr. John Hatfield  male
108       3                    Calic, Mr. Jovo  male

#### 1.5.5 ‰ªªÂä°‰∫îÔºö‰ΩøÁî®ilocÊñπÊ≥ïÂ∞ÜmidageÁöÑÊï∞ÊçÆ‰∏≠Á¨¨100Ôºå105Ôºå108Ë°åÁöÑ"Pclass"Ôºå"Name"Âíå"Sex"ÁöÑÊï∞ÊçÆÊòæÁ§∫Âá∫Êù•

In [51]:
#ÂÜôÂÖ•‰ª£Á†Å
midage2.iloc[[100,105,108], [3,4,5]]

     Pclass                               Name   Sex
100       2  Byles, Rev. Thomas Roussel Davids  male
105       3           Cribb, Mr. John Hatfield  male
108       3                    Calic, Mr. Jovo  male

„ÄêÊÄùËÄÉ„ÄëÂØπÊØî`iloc`Âíå`loc`ÁöÑÂºÇÂêå